vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/common/TIM_TYPE_A_registers.h
/* Common TIM_TYPE_A — generated by stm32_reggen.py.
 * Do not edit this file manually!
 * Superset across: stm32f030, stm32f427, stm32g070, stm32c092
 */

#pragma once
#include "../../stm32_gen_common.h"
#include "TIM_TYPE_A_index.h"

typedef union {
	struct {
		uint32_t CEN           : 1; // /*!<Counter enable */
		uint32_t UDIS          : 1; // /*!<Update disable */
		uint32_t URS           : 1; // /*!<Update request source */
		uint32_t OPM           : 1; // /*!<One pulse mode */
		uint32_t DIR           : 1; // /*!<Direction */
		uint32_t CMS           : 2; // /*!<CMS[1:0] bits (Center-aligned mode selection) */
		uint32_t ARPE          : 1; // /*!<Auto-reload preload enable */
		uint32_t CKD           : 2; // /*!<CKD[1:0] bits (clock division) */
		uint32_t _reserved10   : 1;
		uint32_t UIFREMAP      : 1; // /*!<Update interrupt flag remap */
		uint32_t _reserved12   :20;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,cr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,cr1),bits);

typedef union {
	struct {
		uint32_t CCPC          : 1; // /*!<Capture/Compare Preloaded Control */
		uint32_t _reserved1    : 1;
		uint32_t CCUS          : 1; // /*!<Capture/Compare Control Update Selection */
		uint32_t CCDS          : 1; // /*!<Capture/Compare DMA Selection */
		uint32_t MMS           : 3; // /*!<MMS[2:0] bits (Master Mode Selection) */
		uint32_t TI1S          : 1; // /*!<TI1 Selection */
		uint32_t OIS1          : 1; // /*!<Output Idle state 1 (OC1 output) */
		uint32_t OIS1N         : 1; // /*!<Output Idle state 1 (OC1N output) */
		uint32_t OIS2          : 1; // /*!<Output Idle state 2 (OC2 output) */
		uint32_t OIS2N         : 1; // /*!<Output Idle state 2 (OC2N output) */
		uint32_t OIS3          : 1; // /*!<Output Idle state 3 (OC3 output) */
		uint32_t OIS3N         : 1; // /*!<Output Idle state 3 (OC3N output) */
		uint32_t OIS4          : 1; // /*!<Output Idle state 4 (OC4 output) */
		uint32_t _reserved15   : 1;
		uint32_t OIS5          : 1; // /*!<Output Idle state 5 (OC5 output) */
		uint32_t _reserved17   : 1;
		uint32_t OIS6          : 1; // /*!<Output Idle state 6 (OC6 output) */
		uint32_t _reserved19   : 1;
		uint32_t MMS2          : 4; // /*!<MMS[2:0] bits (Master Mode Selection) */
		uint32_t _reserved24   : 8;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,cr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,cr2),bits);

typedef union {
	struct {
		uint32_t SMS           : 3; // /*!<SMS[2:0] bits (Slave mode selection) */
		uint32_t OCCS          : 1; // /*!< OCREF clear selection */
		uint32_t TS            : 3; // /*!<TS[2:0] bits (Trigger selection) */
		uint32_t MSM           : 1; // /*!<Master/slave mode */
		uint32_t ETF           : 4; // /*!<ETF[3:0] bits (External trigger filter) */
		uint32_t ETPS          : 2; // /*!<ETPS[1:0] bits (External trigger prescaler) */
		uint32_t ECE           : 1; // /*!<External clock enable */
		uint32_t ETP           : 1; // /*!<External trigger polarity */
		uint32_t SMS_1         : 1; 
		uint32_t _reserved17   : 3;
		uint32_t TS_1          : 2; 
		uint32_t _reserved22   :10;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,smcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,smcr),bits);

typedef union {
	struct {
		uint32_t UIE           : 1; // /*!<Update interrupt enable */
		uint32_t CC1IE         : 1; // /*!<Capture/Compare 1 interrupt enable */
		uint32_t CC2IE         : 1; // /*!<Capture/Compare 2 interrupt enable */
		uint32_t CC3IE         : 1; // /*!<Capture/Compare 3 interrupt enable */
		uint32_t CC4IE         : 1; // /*!<Capture/Compare 4 interrupt enable */
		uint32_t COMIE         : 1; // /*!<COM interrupt enable */
		uint32_t TIE           : 1; // /*!<Trigger interrupt enable */
		uint32_t BIE           : 1; // /*!<Break interrupt enable */
		uint32_t UDE           : 1; // /*!<Update DMA request enable */
		uint32_t CC1DE         : 1; // /*!<Capture/Compare 1 DMA request enable */
		uint32_t CC2DE         : 1; // /*!<Capture/Compare 2 DMA request enable */
		uint32_t CC3DE         : 1; // /*!<Capture/Compare 3 DMA request enable */
		uint32_t CC4DE         : 1; // /*!<Capture/Compare 4 DMA request enable */
		uint32_t COMDE         : 1; // /*!<COM DMA request enable */
		uint32_t TDE           : 1; // /*!<Trigger DMA request enable */
		uint32_t _reserved15   :17;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,dier);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,dier),bits);

typedef union {
	struct {
		uint32_t UIF           : 1; // /*!<Update interrupt Flag */
		uint32_t CC1IF         : 1; // /*!<Capture/Compare 1 interrupt Flag */
		uint32_t CC2IF         : 1; // /*!<Capture/Compare 2 interrupt Flag */
		uint32_t CC3IF         : 1; // /*!<Capture/Compare 3 interrupt Flag */
		uint32_t CC4IF         : 1; // /*!<Capture/Compare 4 interrupt Flag */
		uint32_t COMIF         : 1; // /*!<COM interrupt Flag */
		uint32_t TIF           : 1; // /*!<Trigger interrupt Flag */
		uint32_t BIF           : 1; // /*!<Break interrupt Flag */
		uint32_t B2IF          : 1; // /*!<Break 2 interrupt Flag */
		uint32_t CC1OF         : 1; // /*!<Capture/Compare 1 Overcapture Flag */
		uint32_t CC2OF         : 1; // /*!<Capture/Compare 2 Overcapture Flag */
		uint32_t CC3OF         : 1; // /*!<Capture/Compare 3 Overcapture Flag */
		uint32_t CC4OF         : 1; // /*!<Capture/Compare 4 Overcapture Flag */
		uint32_t SBIF          : 1; // /*!<System Break interrupt Flag */
		uint32_t _reserved14   : 2;
		uint32_t CC5IF         : 1; // /*!<Capture/Compare 5 interrupt Flag */
		uint32_t CC6IF         : 1; // /*!<Capture/Compare 6 interrupt Flag */
		uint32_t _reserved18   :14;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,sr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,sr),bits);

typedef union {
	struct {
		uint32_t UG            : 1; // /*!<Update Generation */
		uint32_t CC1G          : 1; // /*!<Capture/Compare 1 Generation */
		uint32_t CC2G          : 1; // /*!<Capture/Compare 2 Generation */
		uint32_t CC3G          : 1; // /*!<Capture/Compare 3 Generation */
		uint32_t CC4G          : 1; // /*!<Capture/Compare 4 Generation */
		uint32_t COMG          : 1; // /*!<Capture/Compare Control Update Generation */
		uint32_t TG            : 1; // /*!<Trigger Generation */
		uint32_t BG            : 1; // /*!<Break Generation */
		uint32_t B2G           : 1; // /*!<Break 2 Generation */
		uint32_t _reserved9    :23;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,egr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,egr),bits);

typedef union {
	struct {
		uint32_t CC1S          : 2; // /*!<CC1S[1:0] bits (Capture/Compare 1 Selection) */
		uint32_t IC1PSC        : 2; // /*!<IC1PSC[1:0] bits (Input Capture 1 Prescaler) */
		uint32_t OC1PE         : 1; // /*!<Output Compare 1 Preload enable */
		uint32_t IC1F          : 4; // /*!<IC1F[3:0] bits (Input Capture 1 Filter) */
		uint32_t OC1CE         : 1; // /*!<Output Compare 1Clear Enable */
		uint32_t CC2S          : 2; // /*!<CC2S[1:0] bits (Capture/Compare 2 Selection) */
		uint32_t IC2PSC        : 2; // /*!<IC2PSC[1:0] bits (Input Capture 2 Prescaler) */
		uint32_t OC2PE         : 1; // /*!<Output Compare 2 Preload enable */
		uint32_t IC2F          : 4; // /*!<IC2F[3:0] bits (Input Capture 2 Filter) */
		uint32_t OC2CE         : 1; // /*!<Output Compare 2 Clear Enable */
		uint32_t OC1M_1        : 1; 
		uint32_t _reserved17   : 7;
		uint32_t OC2M_1        : 1; 
		uint32_t _reserved25   : 7;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,ccmr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,ccmr1),bits);

typedef union {
	struct {
		uint32_t CC3S          : 2; // /*!<CC3S[1:0] bits (Capture/Compare 3 Selection) */
		uint32_t IC3PSC        : 2; // /*!<IC3PSC[1:0] bits (Input Capture 3 Prescaler) */
		uint32_t OC3PE         : 1; // /*!<Output Compare 3 Preload enable */
		uint32_t IC3F          : 4; // /*!<IC3F[3:0] bits (Input Capture 3 Filter) */
		uint32_t OC3CE         : 1; // /*!<Output Compare 3 Clear Enable */
		uint32_t CC4S          : 2; // /*!<CC4S[1:0] bits (Capture/Compare 4 Selection) */
		uint32_t IC4PSC        : 2; // /*!<IC4PSC[1:0] bits (Input Capture 4 Prescaler) */
		uint32_t OC4PE         : 1; // /*!<Output Compare 4 Preload enable */
		uint32_t IC4F          : 4; // /*!<IC4F[3:0] bits (Input Capture 4 Filter) */
		uint32_t OC4CE         : 1; // /*!<Output Compare 4 Clear Enable */
		uint32_t OC3M_1        : 1; 
		uint32_t _reserved17   : 7;
		uint32_t OC4M_1        : 1; 
		uint32_t _reserved25   : 7;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,ccmr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,ccmr2),bits);

typedef union {
	struct {
		uint32_t CC1E          : 1; // /*!<Capture/Compare 1 output enable */
		uint32_t CC1P          : 1; // /*!<Capture/Compare 1 output Polarity */
		uint32_t CC1NE         : 1; // /*!<Capture/Compare 1 Complementary output enable */
		uint32_t CC1NP         : 1; // /*!<Capture/Compare 1 Complementary output Polarity */
		uint32_t CC2E          : 1; // /*!<Capture/Compare 2 output enable */
		uint32_t CC2P          : 1; // /*!<Capture/Compare 2 output Polarity */
		uint32_t CC2NE         : 1; // /*!<Capture/Compare 2 Complementary output enable */
		uint32_t CC2NP         : 1; // /*!<Capture/Compare 2 Complementary output Polarity */
		uint32_t CC3E          : 1; // /*!<Capture/Compare 3 output enable */
		uint32_t CC3P          : 1; // /*!<Capture/Compare 3 output Polarity */
		uint32_t CC3NE         : 1; // /*!<Capture/Compare 3 Complementary output enable */
		uint32_t CC3NP         : 1; // /*!<Capture/Compare 3 Complementary output Polarity */
		uint32_t CC4E          : 1; // /*!<Capture/Compare 4 output enable */
		uint32_t CC4P          : 1; // /*!<Capture/Compare 4 output Polarity */
		uint32_t _reserved14   : 1;
		uint32_t CC4NP         : 1; // /*!<Capture/Compare 4 Complementary output Polarity */
		uint32_t CC5E          : 1; // /*!<Capture/Compare 5 output enable */
		uint32_t CC5P          : 1; // /*!<Capture/Compare 5 output Polarity */
		uint32_t _reserved18   : 2;
		uint32_t CC6E          : 1; // /*!<Capture/Compare 6 output enable */
		uint32_t CC6P          : 1; // /*!<Capture/Compare 6 output Polarity */
		uint32_t _reserved22   :10;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,ccer);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,ccer),bits);

typedef union {
	struct {
		uint32_t CNT           :32; // /*!<Counter Value */
		uint32_t UIFCPY        : 1; // /*!<Update interrupt flag copy (if UIFREMAP=1) */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,cnt);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,cnt),bits);

typedef union {
	struct {
		uint32_t PSC           :16; // /*!<Prescaler Value */
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,psc);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,psc),bits);

typedef union {
	struct {
		uint32_t ARR           :32; // /*!<actual auto-reload Value */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,arr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,arr),bits);

typedef union {
	struct {
		uint32_t REP           : 8; // /*!<Repetition Counter Value */
		uint32_t _reserved8    :24;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,rcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,rcr),bits);

typedef union {
	struct {
		uint32_t CCR1          :16; // /*!<Capture/Compare 1 Value */
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,ccr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,ccr1),bits);

typedef union {
	struct {
		uint32_t CCR2          :16; // /*!<Capture/Compare 2 Value */
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,ccr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,ccr2),bits);

typedef union {
	struct {
		uint32_t CCR3          :16; // /*!<Capture/Compare 3 Value */
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,ccr3);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,ccr3),bits);

typedef union {
	struct {
		uint32_t CCR4          :16; // /*!<Capture/Compare 4 Value */
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,ccr4);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,ccr4),bits);

typedef union {
	struct {
		uint32_t DTG           : 8; // /*!<DTG[0:7] bits (Dead-Time Generator set-up) */
		uint32_t LOCK          : 2; // /*!<LOCK[1:0] bits (Lock Configuration) */
		uint32_t OSSI          : 1; // /*!<Off-State Selection for Idle mode */
		uint32_t OSSR          : 1; // /*!<Off-State Selection for Run mode */
		uint32_t BKE           : 1; // /*!<Break enable */
		uint32_t BKP           : 1; // /*!<Break Polarity */
		uint32_t AOE           : 1; // /*!<Automatic Output enable */
		uint32_t MOE           : 1; // /*!<Main Output enable */
		uint32_t BKF           : 4; // /*!<Break Filter for Break 1 */
		uint32_t BK2F          : 4; // /*!<Break Filter for Break 2 */
		uint32_t BK2E          : 1; // /*!<Break enable for Break 2 */
		uint32_t BK2P          : 1; // /*!<Break Polarity for Break 2 */
		uint32_t BKDSRM        : 1; // /*!<Break disarming/re-arming */
		uint32_t BK2DSRM       : 1; // /*!<Break2 disarming/re-arming */
		uint32_t BKBID         : 1; // /*!<Break BIDirectional */
		uint32_t BK2BID        : 1; // /*!<Break2 BIDirectional */
		uint32_t _reserved30   : 2;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,bdtr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,bdtr),bits);

typedef union {
	struct {
		uint32_t DBA           : 5; // /*!<DBA[4:0] bits (DMA Base Address) */
		uint32_t _reserved5    : 3;
		uint32_t DBL           : 5; // /*!<DBL[4:0] bits (DMA Burst Length) */
		uint32_t _reserved13   :19;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,dcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,dcr),bits);

typedef union {
	struct {
		uint32_t DMAB          :16; // /*!<DMA register for burst accesses */
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,dmar);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,dmar),bits);

typedef union {
	struct {
		uint32_t TI1_RMP       : 2; // /*!< TI1_RMP[1:0] bits (TIM11 Input Capture 1 remap) */
		uint32_t _reserved2    : 4;
		uint32_t TI4_RMP       : 2; // /*!<TI4_RMP[1:0] bits (TIM5 Input 4 remap)             */
		uint32_t _reserved8    : 2;
		uint32_t ITR1_RMP      : 2; // /*!<ITR1_RMP[1:0] bits (TIM2 Internal trigger 1 remap) */
		uint32_t _reserved12   :20;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,or);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,or),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 2;
		uint32_t OC5FE         : 1; // /*!<Output Compare 5 Fast enable */
		uint32_t OC5PE         : 1; // /*!<Output Compare 5 Preload enable */
		uint32_t OC5M          : 3; // /*!<OC5M[3:0] bits (Output Compare 5 Mode) */
		uint32_t OC5CE         : 1; // /*!<Output Compare 5 Clear Enable */
		uint32_t _reserved8    : 2;
		uint32_t OC6FE         : 1; // /*!<Output Compare 6 Fast enable */
		uint32_t OC6PE         : 1; // /*!<Output Compare 6 Preload enable */
		uint32_t OC6M          : 3; // /*!<OC6M[3:0] bits (Output Compare 6 Mode) */
		uint32_t OC6CE         : 1; // /*!<Output Compare 6 Clear Enable */
		uint32_t OC5M_1        : 1; 
		uint32_t _reserved17   : 7;
		uint32_t OC6M_1        : 1; 
		uint32_t _reserved25   : 7;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,ccmr3);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,ccmr3),bits);

typedef union {
	struct {
		uint32_t CCR5          :32; // /*!<Capture/Compare 5 Value */
		uint32_t GC5C1         : 1; // /*!<Group Channel 5 and Channel 1 */
		uint32_t GC5C2         : 1; // /*!<Group Channel 5 and Channel 2 */
		uint32_t GC5C3         : 1; // /*!<Group Channel 5 and Channel 3 */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,ccr5);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,ccr5),bits);

typedef union {
	struct {
		uint32_t CCR6          :16; // /*!<Capture/Compare 6 Value */
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,ccr6);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,ccr6),bits);

typedef union {
	struct {
		uint32_t BKINE         : 1; // /*!<BRK BKIN input enable */
		uint32_t BKCMP1E       : 1; // /*!<BRK COMP1 enable */
		uint32_t BKCMP2E       : 1; // /*!<BRK COMP2 enable */
		uint32_t _reserved3    : 6;
		uint32_t BKINP         : 1; // /*!<BRK BKIN input polarity */
		uint32_t BKCMP1P       : 1; // /*!<BRK COMP1 input polarity */
		uint32_t BKCMP2P       : 1; // /*!<BRK COMP2 input polarity */
		uint32_t _reserved12   : 2;
		uint32_t ETRSEL        : 4; // /*!<ETRSEL[3:0] bits (TIM ETR source selection) */
		uint32_t _reserved18   :14;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,af1);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,af1),bits);

typedef union {
	struct {
		uint32_t BK2INE        : 1; // /*!<BRK2 BKIN2 input enable */
		uint32_t BK2CMP1E      : 1; // /*!<BRK2 COMP1 enable */
		uint32_t BK2CMP2E      : 1; // /*!<BRK2 COMP2 enable */
		uint32_t _reserved3    : 6;
		uint32_t BK2INP        : 1; // /*!<BRK2 BKIN2 input polarity */
		uint32_t BK2CMP1P      : 1; // /*!<BRK2 COMP1 input polarity */
		uint32_t BK2CMP2P      : 1; // /*!<BRK2 COMP2 input polarity */
		uint32_t _reserved12   :20;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,af2);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,af2),bits);

typedef union {
	struct {
		uint32_t TI1SEL        : 4; // /*!<TI1SEL[3:0] bits (TIM TI1 SEL)*/
		uint32_t _reserved4    : 4;
		uint32_t TI2SEL        : 4; // /*!<TI2SEL[3:0] bits (TIM TI2 SEL)*/
		uint32_t _reserved12   : 4;
		uint32_t TI3SEL        : 4; // /*!<TI3SEL[3:0] bits (TIM TI3 SEL)*/
		uint32_t _reserved20   : 4;
		uint32_t TI4SEL        : 4; // /*!<TI4SEL[3:0] bits (TIM TI4 SEL)*/
		uint32_t _reserved28   : 4;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_tim_type_a,tisel);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_tim_type_a,tisel),bits);

typedef union {
	struct {
		REGDEF_NAME(com_tim_type_a,cr1) CR1;
		REGDEF_NAME(com_tim_type_a,cr2) CR2;
		REGDEF_NAME(com_tim_type_a,smcr) SMCR;
		REGDEF_NAME(com_tim_type_a,dier) DIER;
		REGDEF_NAME(com_tim_type_a,sr) SR;
		REGDEF_NAME(com_tim_type_a,egr) EGR;
		REGDEF_NAME(com_tim_type_a,ccmr1) CCMR1;
		REGDEF_NAME(com_tim_type_a,ccmr2) CCMR2;
		REGDEF_NAME(com_tim_type_a,ccer) CCER;
		REGDEF_NAME(com_tim_type_a,cnt) CNT;
		REGDEF_NAME(com_tim_type_a,psc) PSC;
		REGDEF_NAME(com_tim_type_a,arr) ARR;
		REGDEF_NAME(com_tim_type_a,rcr) RCR;
		REGDEF_NAME(com_tim_type_a,ccr1) CCR1;
		REGDEF_NAME(com_tim_type_a,ccr2) CCR2;
		REGDEF_NAME(com_tim_type_a,ccr3) CCR3;
		REGDEF_NAME(com_tim_type_a,ccr4) CCR4;
		REGDEF_NAME(com_tim_type_a,bdtr) BDTR;
		REGDEF_NAME(com_tim_type_a,dcr) DCR;
		REGDEF_NAME(com_tim_type_a,dmar) DMAR;
		REGDEF_NAME(com_tim_type_a,or) OR;
		REGDEF_NAME(com_tim_type_a,ccmr3) CCMR3;
		REGDEF_NAME(com_tim_type_a,ccr5) CCR5;
		REGDEF_NAME(com_tim_type_a,ccr6) CCR6;
		REGDEF_NAME(com_tim_type_a,af1) AF1;
		REGDEF_NAME(com_tim_type_a,af2) AF2;
		REGDEF_NAME(com_tim_type_a,tisel) TISEL;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END];
}  REGDEF_NAME(stm32com,tim_type_a);
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(stm32com,tim_type_a)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), CR1) != 0, "Offset mismatch for CR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), CR2) != 4, "Offset mismatch for CR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), SMCR) != 8, "Offset mismatch for SMCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), DIER) != 12, "Offset mismatch for DIER");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), SR) != 16, "Offset mismatch for SR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), EGR) != 20, "Offset mismatch for EGR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), CCMR1) != 24, "Offset mismatch for CCMR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), CCMR2) != 28, "Offset mismatch for CCMR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), CCER) != 32, "Offset mismatch for CCER");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), CNT) != 36, "Offset mismatch for CNT");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), PSC) != 40, "Offset mismatch for PSC");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), ARR) != 44, "Offset mismatch for ARR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), RCR) != 48, "Offset mismatch for RCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), CCR1) != 52, "Offset mismatch for CCR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), CCR2) != 56, "Offset mismatch for CCR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), CCR3) != 60, "Offset mismatch for CCR3");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), CCR4) != 64, "Offset mismatch for CCR4");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), BDTR) != 68, "Offset mismatch for BDTR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), DCR) != 72, "Offset mismatch for DCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), DMAR) != 76, "Offset mismatch for DMAR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), OR) != 80, "Offset mismatch for OR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), CCMR3) != 84, "Offset mismatch for CCMR3");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), CCR5) != 88, "Offset mismatch for CCR5");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), CCR6) != 92, "Offset mismatch for CCR6");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), AF1) != 96, "Offset mismatch for AF1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), AF2) != 100, "Offset mismatch for AF2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,tim_type_a), TISEL) != 104, "Offset mismatch for TISEL");
